In [1]:
import pandas as pd

In [2]:
lst = [1, 2, 3, 4, 5, 6]
print(lst)

[1, 2, 3, 4, 5, 6]

In [4]:
series = pd.Series(lst)
print(series)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [6]:
empty = pd.Series([])
empty

Series([], dtype: object)

In [9]:
a = pd.Series(['p', 'q', 'r'], index=[10, 20, 30])
a

10    p
20    q
30    r
dtype: object

In [12]:
a = pd.Series(['p', 'q', 'r'], index=[10, 20, 30], name = 'alphabet')
a

10    p
20    q
30    r
Name: alphabet, dtype: object

In [14]:
scaler_series = pd.Series(0.5)
scaler_series

0    0.5
dtype: float64

In [15]:
scaler_series = pd.Series(0.5, index=[1, 2, 3])
scaler_series

1    0.5
2    0.5
3    0.5
dtype: float64

In [16]:
################################### Series with Python DIct #######################################

In [17]:
dict_series = pd.Series({'p':1, 'q': 2, 'r': 3, 's': 4})
dict_series

p    1
q    2
r    3
s    4
dtype: int64

In [18]:
dict_series[0]

1

In [19]:
######################################## data frame ##############################################

In [20]:
import pandas as pd

In [21]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [22]:
lst = [1,2,3,4,5]

In [23]:
df = pd.DataFrame(lst)

In [24]:
df

   0
0  1
1  2
2  3
3  4
4  5

In [25]:
lst = [[1, 2, 3, 4],[5, 6, 7, 8]]
df = pd.DataFrame(lst)

In [26]:
df

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [27]:
a = [{'a':5, 'b': 7, 'c':9, 'd':2}, {'a':4, 'b': 5, 'c':11, 'd':12}]
df = pd.DataFrame(a)
df

   a  b   c   d
0  5  7   9   2
1  4  5  11  12

In [28]:
###################################### READING CSV  ##################################

In [37]:
df = pd.read_csv("data.csv")
df

   ID    Name        Add    Phone
0   1   Vivek   djfsdjkf   234235
1   2  Pawan     lsdjfdq    23423
2   3   Kiran  odjgfdkjg  2343242

In [38]:
df.columns

Index(['ID', 'Name', 'Add', 'Phone'], dtype='object')

In [39]:
df.shape

(3, 4)

In [40]:
df.size

12

In [41]:
df.head()

   ID    Name        Add    Phone
0   1   Vivek   djfsdjkf   234235
1   2  Pawan     lsdjfdq    23423
2   3   Kiran  odjgfdkjg  2343242

In [42]:
df.head(1)

   ID   Name       Add   Phone
0   1  Vivek  djfsdjkf  234235

In [43]:
df.tail(1)

   ID   Name        Add    Phone
2   3  Kiran  odjgfdkjg  2343242

In [44]:
df.describe()

        ID         Phone
count  3.0  3.000000e+00
mean   2.0  8.669667e+05
std    1.0  1.282830e+06
min    1.0  2.342300e+04
25%    1.5  1.288290e+05
50%    2.0  2.342350e+05
75%    2.5  1.288738e+06
max    3.0  2.343242e+06

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      3 non-null      int64
 1   Name    3 non-null      object
 2   Add     3 non-null      object
 3   Phone   3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

In [46]:
#####################3333 Handling missing value

In [47]:
df = pd.read_csv("data.csv")
df

   ID    Name         Add      Phone
0   1   Vivek    djfsdjkf   234235.0
1   2  Pawan      lsdjfdq    23423.0
2   3   Kiran   odjgfdkjg  2343242.0
3   4   Akash     skdfldk        NaN
4   5   Ankit  sdfdgfdgdf        NaN

In [48]:
df.isnull()

      ID   Name    Add  Phone
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False   True
4  False  False  False   True

In [49]:
df.isnull().sum()

ID       0
Name     0
Add      0
Phone    2
dtype: int64

In [51]:
df.isnull().sum().sum()

2

In [53]:
df.shape

(5, 4)

In [54]:
df2 = df.dropna()

In [55]:
df2

   ID    Name        Add      Phone
0   1   Vivek   djfsdjkf   234235.0
1   2  Pawan     lsdjfdq    23423.0
2   3   Kiran  odjgfdkjg  2343242.0

In [56]:
df.shape

(5, 4)

In [57]:
df2.shape

(3, 4)

In [58]:
df.dropna(inplace = True)

In [59]:
df.shape

(3, 4)

In [60]:
df

   ID    Name        Add      Phone
0   1   Vivek   djfsdjkf   234235.0
1   2  Pawan     lsdjfdq    23423.0
2   3   Kiran  odjgfdkjg  2343242.0

In [61]:
df.isnull()

      ID   Name    Add  Phone
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False

In [62]:
df = pd.read_csv("data.csv")

In [63]:
df.isnull()

      ID   Name    Add  Phone
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False   True
4  False  False  False   True

In [64]:
df.fillna(12)

   ID    Name         Add      Phone
0   1   Vivek    djfsdjkf   234235.0
1   2  Pawan      lsdjfdq    23423.0
2   3   Kiran   odjgfdkjg  2343242.0
3   4   Akash     skdfldk       12.0
4   5   Ankit  sdfdgfdgdf       12.0

In [65]:
 df = pd.read_csv("data.csv")

In [66]:
df.fillna(method = 'ffill')

   ID    Name         Add      Phone
0   1   Vivek    djfsdjkf   234235.0
1   2  Pawan      lsdjfdq    23423.0
2   3   Kiran   odjgfdkjg  2343242.0
3   4   Akash     skdfldk  2343242.0
4   5   Ankit  sdfdgfdgdf  2343242.0

In [67]:
 df = pd.read_csv("data.csv")

In [68]:
df.fillna(method = 'bfill')

   ID    Name         Add      Phone
0   1   Vivek    djfsdjkf   234235.0
1   2  Pawan      lsdjfdq    23423.0
2   3   Kiran   odjgfdkjg  2343242.0
3   4   Akash     skdfldk        NaN
4   5   Ankit  sdfdgfdgdf        NaN

In [69]:
df.replace(to_replace=23423, value=30)

   ID    Name         Add      Phone
0   1   Vivek    djfsdjkf   234235.0
1   2  Pawan      lsdjfdq       30.0
2   3   Kiran   odjgfdkjg  2343242.0
3   4   Akash     skdfldk        NaN
4   5   Ankit  sdfdgfdgdf        NaN

In [73]:
df.replace(to_replace=['djfsdjkf', 'lsdjfdq'], value=['Delhi', 'Mumbai'])

   ID    Name         Add      Phone
0   1   Vivek       Delhi   234235.0
1   2  Pawan       Mumbai    23423.0
2   3   Kiran   odjgfdkjg  2343242.0
3   4   Akash     skdfldk        NaN
4   5   Ankit  sdfdgfdgdf        NaN

In [81]:
df.loc[0] ############################## loc

ID              1
Name        Vivek
Add      djfsdjkf
Phone    234235.0
Name: 0, dtype: object

In [82]:
df.loc[df['ID']>3, ['Add']]

          Add
3     skdfldk
4  sdfdgfdgdf

In [83]:
################################# loc

In [84]:
df.iloc[0]

ID              1
Name        Vivek
Add      djfsdjkf
Phone    234235.0
Name: 0, dtype: object

In [85]:
df = pd.read_csv("data.csv")

In [86]:
df

   ID    Name     Add     Phone
0   1   Vivek   Delhi    234235
1   2  Pawan   Mumbai     23423
2   3   Kiran   Delhi   2343242
3   4   Akash   Delhi  12312341
4   5   Ankit  Mumbai   1232412
5   6   Ishan  Punjab   1232412

In [90]:
loc_group = df.groupby(by = 'Add')
loc_group

In [91]:
loc_group.groups

{'Delhi': [0, 2, 3], 'Mumbai': [1, 4], 'Punjab': [5]}

In [97]:
df3 = pd.DataFrame({'Roll No.': [1, 2, 3, 4, 7], 'Physics': [34, 23, 43, 32, 12]})
df4 = pd.DataFrame({'Roll No.': [1, 2, 3, 8, 9], 'Chem': [34, 23, 43, 32, 12]})

In [93]:
pd.merge(df3, df4)

   Roll No.  Physics  Chem
0         1       34    34
1         2       23    23
2         3       43    43

In [101]:
df3 = pd.DataFrame({'Roll No.': [1, 2, 3, 4, 7], 'Physics': [34, 23, 43, 32, 12]})
df4 = pd.DataFrame({'Roll No.': [1, 2, 3, 8, 9], 'Physics': [34, 23, 43, 32, 12]})
print(df3)
print(df4)
df3.append(df4)

   Roll No.  Physics
0         1       34
1         2       23
2         3       43
3         4       32
4         7       12
   Roll No.  Physics
0         1       34
1         2       23
2         3       43
3         8       32
4         9       12

AttributeError: 'DataFrame' object has no attribute 'append'